#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xE0 (0x218 - 0x138)
// BlueprintGeneratedClass BP_ActionSleep.BP_ActionSleep_C
class UBP_ActionSleep_C : public UPalActionBase
{
public:
	uint8                                        Pad_1B0C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x140(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                          TempMontage;                                       // 0x148(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         IsFlyPal;                                          // 0x150(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1B11[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          TimeHandle;                                        // 0x158(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         EyeCloseAble;                                      // 0x160(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1B13[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UNiagaraComponent*                     Effect;                                            // 0x168(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         UseMontageFacial;                                  // 0x170(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1B16[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPalFacialComponent*                   FacialComp;                                        // 0x178(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         StartMontageNotifyExist;                           // 0x180(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         LoopMontageNotifyExist;                            // 0x181(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1B19[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UAkAudioEvent>          SmallSleepSound;                                   // 0x188(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>          MiddleSleepSound;                                  // 0x1B8(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>          BigSleepSound;                                     // 0x1E8(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_ActionSleep_C* GetDefaultObj();

	void StartSleepSound(class UAnimMontage* Montage);
	void SetSleepSightFlag(bool Disable, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class AController* CallFunc_GetController_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UPalAISensorComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue_2);
	void OnLoaded_49BB828F4B31C2356072F4BF56562BE4(class UObject* Loaded);
	void OnNotifyEnd_6BF59DE942FABEC009135FAF74D0892D(class FName NotifyName);
	void OnNotifyBegin_6BF59DE942FABEC009135FAF74D0892D(class FName NotifyName);
	void OnInterrupted_6BF59DE942FABEC009135FAF74D0892D(class FName NotifyName);
	void OnBlendOut_6BF59DE942FABEC009135FAF74D0892D(class FName NotifyName);
	void OnCompleted_6BF59DE942FABEC009135FAF74D0892D(class FName NotifyName);
	void OnLoaded_5EEF21F14544E3FF5966AEA11A939260(class UObject* Loaded);
	void OnLoaded_25736171428620E543B76A903CB7DDF9(class UObject* Loaded);
	void CustomEvent(class UAnimMontage* Montage);
	void StopSleepSound();
	void OnBeginAction();
	void OnEndAction();
	void EffectPlayEvent();
	void TickAction(float DeltaTime);
	void PlaySleepSound();
	void ExecuteUbergraph_BP_ActionSleep(int32 EntryPoint, enum class EPalActionType Temp_byte_Variable, enum class EPalGeneralMontageType Temp_byte_Variable_1, enum class EPalGeneralMontageType Temp_byte_Variable_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class FName K2Node_CustomEvent_NotifyName_4, class FName K2Node_CustomEvent_NotifyName_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class FName K2Node_CustomEvent_NotifyName_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class FName K2Node_CustomEvent_NotifyName_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class FName K2Node_CustomEvent_NotifyName, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class FName Temp_name_Variable, enum class EPalGeneralMontageType Temp_byte_Variable_3, class UObject* K2Node_CustomEvent_Loaded_1, class UObject* Temp_object_Variable, class UNiagaraSystem* K2Node_DynamicCast_AsNiagara_System, bool K2Node_DynamicCast_bSuccess, class UObject* K2Node_CustomEvent_Loaded, class UObject* Temp_object_Variable_1, class UNiagaraSystem* K2Node_DynamicCast_AsNiagara_System_1, bool K2Node_DynamicCast_bSuccess_1, enum class EPalGeneralMontageType Temp_byte_Variable_4, enum class EPalGeneralMontageType Temp_byte_Variable_5, TSoftObjectPtr<class UAkAudioEvent> Temp_softobject_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class UAnimMontage* K2Node_CustomEvent_Montage, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue, FDelegateProperty_ Temp_delegate_Variable, TArray<struct FAkExternalSourceInfo>& Temp_struct_Variable, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_1, enum class EPalGeneralMontageType Temp_byte_Variable_6, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_2, class UAnimMontage* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_3, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_4, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_5, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue_1, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_6, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_7, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue, float CallFunc_PlayAnimMontage_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_8, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_9, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class UAnimMontage* CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue, class UAnimMontage* CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, class UAnimMontage* CallFunc_Map_Find_Value_3, bool CallFunc_Map_Find_ReturnValue_3, enum class EPalSizeType Temp_byte_Variable_7, float K2Node_Event_DeltaTime, TSoftObjectPtr<class UAkAudioEvent> K2Node_Select_Default, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_10, class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue_1, class UAkAudioEvent* K2Node_DynamicCast_AsAk_Audio_Event, bool K2Node_DynamicCast_bSuccess_2, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, int32 CallFunc_PostEvent_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_11, class UPalFacialComponent* CallFunc_GetComponentByClass_ReturnValue_2, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_12, class UPalFacialComponent* CallFunc_GetComponentByClass_ReturnValue_3, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_13, bool CallFunc_IsValid_ReturnValue_1, class UPalFacialComponent* CallFunc_GetComponentByClass_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_2, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_14, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_15, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_5, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_16, class UAnimMontage* CallFunc_Map_Find_Value_4, bool CallFunc_Map_Find_ReturnValue_4, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_17, class UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, TSoftObjectPtr<class UNiagaraSystem> CallFunc_GetOverrideSleepFX_ReturnValue, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_6, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_5, class UNiagaraComponent* CallFunc_SpawnSystemAttached_ReturnValue, bool CallFunc_IsValid_ReturnValue_6, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_IsValid_ReturnValue_7, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_18, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue_2, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_19, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue_3, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_20, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_21, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_7, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_22, class UPalFacialComponent* CallFunc_GetComponentByClass_ReturnValue_8, class UAnimMontage* CallFunc_Map_Find_Value_5, bool CallFunc_Map_Find_ReturnValue_5, class UAnimMontage* CallFunc_Map_Find_Value_6, bool CallFunc_Map_Find_ReturnValue_6, bool CallFunc_ExistFacialNotifyInMontage_ReturnValue, bool CallFunc_ExistFacialNotifyInMontage_ReturnValue_1, class UObject* Temp_object_Variable_2, bool CallFunc_BooleanOR_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, class UObject* K2Node_CustomEvent_Loaded_2, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_23, class UPalFacialComponent* CallFunc_GetComponentByClass_ReturnValue_9, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_24, class UPalFacialComponent* CallFunc_GetComponentByClass_ReturnValue_10, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_25, const struct FHitResult& CallFunc_K2_SetWorldRotation_SweepHitResult, class UPalCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_11, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_26, class UPalCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_12);
};

}


