#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1B9 (0x2F1 - 0x138)
// BlueprintGeneratedClass BP_Action_Grappling.BP_Action_Grappling_C
class UBP_Action_Grappling_C : public UPalActionBase
{
public:
	uint8                                        Pad_EE0[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x140(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	double                                       MoveSpeed;                                         // 0x148(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               TargetLocation;                                    // 0x150(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  FlagName;                                          // 0x168(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                            Out_Hit;                                           // 0x170(0xE8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                         IsClimb;                                           // 0x258(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_EE4[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               MoveVec;                                           // 0x260(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsJumping;                                         // 0x278(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_EE5[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Move_End_Location;                                 // 0x280(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       DelaySpeedRate;                                    // 0x298(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentTime;                                       // 0x2A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               PrevLocation;                                      // 0x2A8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CurrentVelocity;                                   // 0x2C0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       JumpPower;                                         // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ReleaseVelocityRare;                               // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       EasingTime;                                        // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsEndCompleted;                                    // 0x2F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_Action_Grappling_C* GetDefaultObj();

	void CalcCurrentVelocity(float DeltaTime, const struct FVector& CallFunc_Conv_FloatToVector_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Divide_VectorVector_ReturnValue);
	struct FVector GetReleaseVelocity(class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue);
	void LookAtTargetLocation(float DeltaTime, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue);
	void SetPlayerVelocity(const struct FVector& Velocity, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue);
	void IsPlayerFalling(bool* IsFalling, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue, bool CallFunc_IsFalling_ReturnValue);
	void GetCurrentSpeed(double* CurrentSpeed, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_FMin_ReturnValue, double CallFunc_Ease_ReturnValue);
	void NotifyStartToWeapon(class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class APalPlayerCharacter* K2Node_DynamicCast_AsPal_Player_Character, bool K2Node_DynamicCast_bSuccess, class APalWeaponBase* CallFunc_GetHasWeapon_ReturnValue, class ABP_GrapplingGun_C* K2Node_DynamicCast_AsBP_Grappling_Gun, bool K2Node_DynamicCast_bSuccess_1);
	void NotifyFinishToWeapon(class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class APalPlayerCharacter* K2Node_DynamicCast_AsPal_Player_Character, bool K2Node_DynamicCast_bSuccess, class APalWeaponBase* CallFunc_GetHasWeapon_ReturnValue, class ABP_GrapplingGun_C* K2Node_DynamicCast_AsBP_Grappling_Gun, bool K2Node_DynamicCast_bSuccess_1);
	void CanClamb(bool* Result, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, double CallFunc_Dot_VectorVector_ReturnValue, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void IsMoveingEnd(const struct FVector& PlayerLocation, double InCapsuleRadius, double InCapsuleHelfHeight, bool* IsMovingEnd, bool CallFunc_CanClamb_Result, double CallFunc_FMax_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_IsNearTwoPoint_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, float CallFunc_IsNearTwoPoint_distance_ImplicitCast);
	void SetGravityDisable(bool IsDisable, double CallFunc_SelectFloat_ReturnValue, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue, float CallFunc_SetGravityZMultiplier_rate_ImplicitCast);
	void CalcMoveVector(const struct FVector& PlayerLocation, double DeltaTime, struct FVector* MoveVec, double CallFunc_GetCurrentSpeed_CurrentSpeed, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1);
	void Disable_Movement(bool Disable, class UPalCharacterMovementComponent* CharacterMovementComponent, bool CallFunc_Not_PreBool_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, float CallFunc_Conv_BoolToFloat_ReturnValue, class UPalCharacterMovementComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void DisableShooter(bool Disable, enum class EPalShooterFlagContainerPriority Priority, class UPalShooterComponent* Shooter, bool CallFunc_IsValid_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class UPalShooterComponent* CallFunc_GetComponentByClass_ReturnValue);
	void UpdateGraplingMove(float DeltaTime, const struct FVector& PlayerLocation, double CapsuleHalfHeight, float CapsuleRadius, double CallFunc_Add_DoubleDouble_ReturnValue, bool CallFunc_CanClamb_Result, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, bool CallFunc_IsMoveingEnd_IsMovingEnd, const struct FHitResult& CallFunc_K2_AddActorWorldOffset_SweepHitResult, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_2, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, TArray<class AActor*>& Temp_object_Variable, class UCapsuleComponent* K2Node_DynamicCast_AsCapsule_Collision, bool K2Node_DynamicCast_bSuccess, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_1, const struct FHitResult& CallFunc_CapsuleTraceSingle_OutHit, bool CallFunc_CapsuleTraceSingle_ReturnValue, const struct FVector& CallFunc_CalcMoveVector_MoveVec, double CallFunc_Add_DoubleDouble_B_ImplicitCast, double CallFunc_IsMoveingEnd_InCapsuleRadius_ImplicitCast, double CallFunc_CalcMoveVector_DeltaTime_ImplicitCast, double K2Node_VariableSet_CapsuleHalfHeight_ImplicitCast, float CallFunc_CapsuleTraceSingle_HalfHeight_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast, float CallFunc_CapsuleTraceSingle_Radius_ImplicitCast);
	void OnNotifyEnd_2F3E188F4888411060D43AB280C66179(class FName NotifyName);
	void OnNotifyBegin_2F3E188F4888411060D43AB280C66179(class FName NotifyName);
	void OnInterrupted_2F3E188F4888411060D43AB280C66179(class FName NotifyName);
	void OnBlendOut_2F3E188F4888411060D43AB280C66179(class FName NotifyName);
	void OnCompleted_2F3E188F4888411060D43AB280C66179(class FName NotifyName);
	void OnBreakAction();
	void TickAction(float DeltaTime);
	void OnBeginAction();
	void OnEndAction();
	void ExecuteUbergraph_BP_Action_Grappling(int32 EntryPoint, class FName K2Node_CustomEvent_NotifyName_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class FName K2Node_CustomEvent_NotifyName_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class FName K2Node_CustomEvent_NotifyName, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class FName Temp_name_Variable, float K2Node_Event_DeltaTime, const struct FPalNetArchive& CallFunc_GetBlackboard_ReturnValue, const struct FVector& CallFunc_ReadPlayerGrappling_HitLocatoin, const struct FVector& CallFunc_ReadPlayerGrappling_MoveEndLocation, float CallFunc_ReadPlayerGrappling_Speed, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue, class UPalClimbingComponent* CallFunc_GetComponentByClass_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_1, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_2, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue, bool CallFunc_FindMontange_bExist, class UAnimMontage* CallFunc_FindMontange_ReturnValue, class UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue, bool CallFunc_IsValid_ReturnValue, class FName K2Node_CustomEvent_NotifyName_3, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_4, bool CallFunc_FindMontange_bExist_1, class UAnimMontage* CallFunc_FindMontange_ReturnValue_1, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_5, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_6, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue_1, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, bool CallFunc_Greater_DoubleDouble_ReturnValue, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue_2, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_7, bool CallFunc_IsPlayerFalling_IsFalling, class UPalCharacterMovementComponent* CallFunc_GetPalCharacterMovementComponent_ReturnValue_3, class FName K2Node_CustomEvent_NotifyName_4, const struct FVector& CallFunc_MakeVector_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue_1, bool CallFunc_HasAuthority_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_9, bool CallFunc_IsLocalControlActor_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue_2, class AController* CallFunc_GetController_ReturnValue, class UPalRiderComponent* CallFunc_GetComponentByClass_ReturnValue_1, bool CallFunc_IsRiding_ReturnValue, bool CallFunc_GetOffFromPal_ReturnValue, double K2Node_VariableSet_MoveSpeed_ImplicitCast);
};

}


