#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x119 (0x251 - 0x138)
// BlueprintGeneratedClass BP_ActionPairBehaviorBase.BP_ActionPairBehaviorBase_C
class UBP_ActionPairBehaviorBase_C : public UPalActionBase
{
public:
	uint8                                        Pad_2904[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x140(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                               PlayerGoalPos;                                     // 0x148(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FVector                               PalGoalPos;                                        // 0x160(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FRotator                              PlayerGoalRotate;                                  // 0x178(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	struct FRotator                              PalGoalRotate;                                     // 0x190(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	double                                       Timer;                                             // 0x1A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            FinishEvent;                                       // 0x1B0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, AdvancedDisplay, BlueprintCallable)
	double                                       MotionTimeSecond;                                  // 0x1C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PettingCamera_C*                   Camera;                                            // 0x1C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       Alpha;                                             // 0x1D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                       LerpSpeed;                                         // 0x1D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                         RemovePalMode;                                     // 0x1E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                        Pad_2907[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RemoveGoalPos;                                     // 0x1E8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                       AlphaRemove;                                       // 0x200(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                       TempDeltaTime;                                     // 0x208(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                       TempAnimRate;                                      // 0x210(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                         IsJumpCancel;                                      // 0x218(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	enum class EPalActionType                    MonsterActionMontageType;                          // 0x219(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EPalFacialEyeType                 FacialType;                                        // 0x21A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2908[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UObject>                HeadEffectAsset;                                   // 0x220(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	enum class EPalActionType                    EndActionType;                                     // 0x250(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_ActionPairBehaviorBase_C* GetDefaultObj();

	class UNiagaraComponent* SpawnNiagara(const struct FVector& Location, class UObject* Object, class UNiagaraSystem* K2Node_DynamicCast_AsNiagara_System, bool K2Node_DynamicCast_bSuccess, class UNiagaraComponent* CallFunc_SpawnSystemAtLocation_ReturnValue);
	void OnCompleted(class AActor* Human, class AActor* Monster);
	void RemovePalMoveing(class AActor* CallFunc_GetActionTarget_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_FClamp_ReturnValue, const struct FVector& CallFunc_VLerp_ReturnValue, const struct FHitResult& CallFunc_K2_SetActorLocation_SweepHitResult, bool CallFunc_K2_SetActorLocation_ReturnValue, float CallFunc_VLerp_Alpha_ImplicitCast);
	void GetHumanAnime(class UAnimMontage** Montage);
	void StartPettingCamera(class AActor* CallFunc_GetActionTarget_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AController* CallFunc_GetController_ReturnValue, class ABP_PettingCamera_C* CallFunc_FinishSpawningActor_ReturnValue, class APlayerController* K2Node_DynamicCast_AsPlayer_Controller, bool K2Node_DynamicCast_bSuccess);
	void OnNotifyEnd_AFFE27B5471DDCA5938711B5A98C1BAC(class FName NotifyName);
	void OnNotifyBegin_AFFE27B5471DDCA5938711B5A98C1BAC(class FName NotifyName);
	void OnInterrupted_AFFE27B5471DDCA5938711B5A98C1BAC(class FName NotifyName);
	void OnBlendOut_AFFE27B5471DDCA5938711B5A98C1BAC(class FName NotifyName);
	void OnCompleted_AFFE27B5471DDCA5938711B5A98C1BAC(class FName NotifyName);
	void OnNotifyEnd_195B11E24A68AB1C346EBCB5275B82C9(class FName NotifyName);
	void OnNotifyBegin_195B11E24A68AB1C346EBCB5275B82C9(class FName NotifyName);
	void OnInterrupted_195B11E24A68AB1C346EBCB5275B82C9(class FName NotifyName);
	void OnBlendOut_195B11E24A68AB1C346EBCB5275B82C9(class FName NotifyName);
	void OnCompleted_195B11E24A68AB1C346EBCB5275B82C9(class FName NotifyName);
	void OnLoaded_E1928592499A4EC8EA38C6BCC85A61EE(class UObject* Loaded);
	void OnNotifyEnd_00F343BB4B6F993C5A65D28008648678(class FName NotifyName);
	void OnNotifyBegin_00F343BB4B6F993C5A65D28008648678(class FName NotifyName);
	void OnInterrupted_00F343BB4B6F993C5A65D28008648678(class FName NotifyName);
	void OnBlendOut_00F343BB4B6F993C5A65D28008648678(class FName NotifyName);
	void OnCompleted_00F343BB4B6F993C5A65D28008648678(class FName NotifyName);
	void OnBeginAction();
	void TickAction(float DeltaTime);
	void OnEndAction();
	void FinishPetting();
	void JumpCancel();
	void ExecuteUbergraph_BP_ActionPairBehaviorBase(int32 EntryPoint, class AActor* CallFunc_GetActionTarget_ReturnValue, class FName K2Node_CustomEvent_NotifyName_11, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class FName K2Node_CustomEvent_NotifyName_10, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class FName Temp_name_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class FName K2Node_CustomEvent_NotifyName_9, class FName K2Node_CustomEvent_NotifyName_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class FName K2Node_CustomEvent_NotifyName_7, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class FName K2Node_CustomEvent_NotifyName_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, class FName K2Node_CustomEvent_NotifyName_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, class FName Temp_name_Variable_1, class UObject* K2Node_CustomEvent_Loaded, class UObject* Temp_object_Variable, enum class EPalActionType Temp_byte_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, class FName K2Node_CustomEvent_NotifyName_4, class FName K2Node_CustomEvent_NotifyName_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, class FName K2Node_CustomEvent_NotifyName_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, class FName K2Node_CustomEvent_NotifyName_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, class FName K2Node_CustomEvent_NotifyName, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, class FName Temp_name_Variable_2, enum class EPalActionType Temp_byte_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_12, float K2Node_Event_DeltaTime, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_13, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class AActor* CallFunc_GetActionTarget_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_2, class UCapsuleComponent* CallFunc_GetComponentByClass_ReturnValue, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_3, const struct FVector& CallFunc_Conv_FloatToVector_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_14, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_4, class AActor* CallFunc_GetActionTarget_ReturnValue_2, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetActorTransform_SweepHitResult, bool CallFunc_K2_SetActorTransform_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_5, class AActor* CallFunc_GetActionTarget_ReturnValue_3, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_1, class APalCharacter* K2Node_DynamicCast_AsPal_Character, bool K2Node_DynamicCast_bSuccess, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue_1, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_6, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_7, class UPalCharacterMovementComponent* CallFunc_GetComponentByClass_ReturnValue_2, class UPalCharacterMovementComponent* CallFunc_GetComponentByClass_ReturnValue_3, class AActor* CallFunc_GetActionTarget_ReturnValue_4, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, class UCapsuleComponent* CallFunc_GetComponentByClass_ReturnValue_4, double CallFunc_Add_DoubleDouble_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FVector& CallFunc_Conv_FloatToVector_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_GetUpVector_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_8, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, class AActor* CallFunc_GetActionTarget_ReturnValue_5, class UPalLookAtComponent* CallFunc_GetComponentByClass_ReturnValue_5, class AActor* CallFunc_GetActionTarget_ReturnValue_6, class UPalLookAtComponent* CallFunc_GetComponentByClass_ReturnValue_6, class AActor* CallFunc_GetActionTarget_ReturnValue_7, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_9, class UPalFacialComponent* CallFunc_GetComponentByClass_ReturnValue_7, class UPalShooterComponent* CallFunc_GetComponentByClass_ReturnValue_8, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_10, class AActor* CallFunc_GetActionTarget_ReturnValue_8, class UPalShooterComponent* CallFunc_GetComponentByClass_ReturnValue_9, class UPalFacialComponent* CallFunc_GetComponentByClass_ReturnValue_10, class AActor* CallFunc_GetActionTarget_ReturnValue_9, class AActor* CallFunc_GetActionTarget_ReturnValue_10, class UPalActionComponent* CallFunc_GetComponentByClass_ReturnValue_11, class APalCharacter* K2Node_DynamicCast_AsPal_Character_1, bool K2Node_DynamicCast_bSuccess_1, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_12, class AActor* CallFunc_GetActionTarget_ReturnValue_11, class AActor* CallFunc_GetActionTarget_ReturnValue_12, class APalCharacter* K2Node_DynamicCast_AsPal_Character_2, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_GetActiveActorFlag_ReturnValue, class AActor* CallFunc_GetActionTarget_ReturnValue_13, class FName K2Node_CustomEvent_NotifyName_13, class UPalSkeletalMeshComponent* CallFunc_GetComponentByClass_ReturnValue_13, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_14, bool CallFunc_IsValid_ReturnValue_2, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class AActor* CallFunc_GetActionTarget_ReturnValue_14, class UNiagaraComponent* CallFunc_SpawnNiagara_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_11, class AController* CallFunc_GetController_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_12, class APlayerController* K2Node_DynamicCast_AsPlayer_Controller, bool K2Node_DynamicCast_bSuccess_3, class AController* CallFunc_GetController_ReturnValue_1, class APlayerController* K2Node_DynamicCast_AsPlayer_Controller_1, bool K2Node_DynamicCast_bSuccess_4, class UAnimMontage* CallFunc_GetHumanAnime_Montage, class UAnimMontage* CallFunc_GetHumanAnime_Montage_1, class UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, class UPalDatabaseCharacterParameter* CallFunc_GetDatabaseCharacterParameter_ReturnValue, class UPalPettingPresset* CallFunc_GetPettingPreset_ReturnValue, float CallFunc_GetDistance_ReturnValue, const struct FVector& CallFunc_Conv_FloatToVector_ReturnValue_2, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, const struct FRotator& CallFunc_RLerp_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, const struct FVector& CallFunc_VLerp_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetActorTransform_SweepHitResult_1, bool CallFunc_K2_SetActorTransform_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_15, class FName K2Node_CustomEvent_NotifyName_12, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Vector_Normal2D_ReturnValue, class AActor* CallFunc_GetActionTarget_ReturnValue_15, double CallFunc_Multiply_DoubleDouble_ReturnValue, class USkeletalMeshComponent* CallFunc_GetMainMeshByActor_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_1, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_15, double CallFunc_FClamp_ReturnValue, class UAnimMontage* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class AActor* CallFunc_GetActionTarget_ReturnValue_16, class AActor* CallFunc_GetActionTarget_ReturnValue_17, class APalCharacter* K2Node_DynamicCast_AsPal_Character_3, bool K2Node_DynamicCast_bSuccess_5, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_16, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_17, const struct FVector& CallFunc_Conv_FloatToVector_ReturnValue_3, class UAnimMontage* CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_2, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_3, class AActor* CallFunc_GetActionTarget_ReturnValue_18, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_18, class UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_4, class AActor* CallFunc_GetActionTarget_ReturnValue_19, class UPalStaticCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue_19, class FName K2Node_CustomEvent_NotifyName_14, bool CallFunc_Greater_DoubleDouble_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_13, class AController* CallFunc_GetController_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_5, class APalPlayerController* K2Node_DynamicCast_AsPal_Player_Controller, bool K2Node_DynamicCast_bSuccess_6, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_14, class AController* CallFunc_GetController_ReturnValue_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_16, bool CallFunc_IsValid_ReturnValue_6, class APalPlayerController* K2Node_DynamicCast_AsPal_Player_Controller_1, bool K2Node_DynamicCast_bSuccess_7, class AActor* CallFunc_GetActionTarget_ReturnValue_20, class UPalFacialComponent* CallFunc_GetComponentByClass_ReturnValue_20, class UAnimMontage* CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, class UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2, bool CallFunc_ExistEyeNotifyInMontage_ReturnValue, bool CallFunc_IsValid_ReturnValue_7, class UAnimMontage* CallFunc_Map_Find_Value_3, bool CallFunc_Map_Find_ReturnValue_3, class UPalActionBase* CallFunc_PlayActionByType_ReturnValue, class AActor* CallFunc_GetActionTarget_ReturnValue_21, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_15, bool CallFunc_NotEqual_ByteByte_ReturnValue, class AActor* CallFunc_GetActionTarget_ReturnValue_22, double K2Node_VariableSet_tempDeltaTime_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast, float CallFunc_MakeRotator_Yaw_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast, float CallFunc_RLerp_Alpha_ImplicitCast, float CallFunc_VLerp_Alpha_ImplicitCast, float CallFunc_CreateProxyObjectForPlayMontage_PlayRate_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast);
	void FinishEvent__DelegateSignature();
};

}


