#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x358 (0x490 - 0x138)
// BlueprintGeneratedClass BP_ActionRideBase.BP_ActionRideBase_C
class UBP_ActionRideBase_C : public UPalActionBase
{
public:
	uint8                                        Pad_291E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x140(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                         IsSuccess;                                         // 0x148(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_291F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ToFinalTime;                                       // 0x150(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InterpTimer;                                       // 0x158(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalRiderComponent*                    RiderComponent;                                    // 0x160(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalRideMarkerComponent*               RideMarker;                                        // 0x168(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            StartTransform;                                    // 0x170(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            JunctionPoint;                                     // 0x1D0(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ToJunctionTime;                                    // 0x230(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERideActionState                  State;                                             // 0x238(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2922[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              StartMonsterRotator;                               // 0x240(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              EndMonsterRotator;                                 // 0x258(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                       MonsterRotatorInterpTime;                          // 0x270(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MonsterRotatorInterpTimer;                         // 0x278(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsCancelMonsterRotation;                           // 0x280(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2923[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               StartMeshLocation;                                 // 0x288(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               EndMeshLocation;                                   // 0x2A0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2924[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RightJunctionPoint;                                // 0x2C0(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            LeftJunctionPoint;                                 // 0x320(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          FrontRideAnimation;                                // 0x380(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          RearRideAnimation;                                 // 0x388(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          LeftRideAnimation;                                 // 0x390(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          RightRideAnimation;                                // 0x398(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          RideAnimation;                                     // 0x3A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2925[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            FrontJunctionPoint;                                // 0x3B0(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            RearJunctionPoint;                                 // 0x410(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                         RideStartSoundAKEvent;                             // 0x470(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                         RideCompleteSoundAKEvent;                          // 0x478(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                  ShooterComponent;                                  // 0x480(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                  FlagName;                                          // 0x488(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_ActionRideBase_C* GetDefaultObj();

	void CheckRidingCompleted();
	void PlayRideCompleteSound(TArray<struct FAkExternalSourceInfo>& Temp_struct_Variable, FDelegateProperty_ Temp_delegate_Variable, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, int32 CallFunc_PostEvent_ReturnValue);
	void PlayRideStartSound(TArray<struct FAkExternalSourceInfo>& Temp_struct_Variable, FDelegateProperty_ Temp_delegate_Variable, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, int32 CallFunc_PostEvent_ReturnValue);
	void Update_Ground_Ray_Cast(class APalCharacter* Rider, class APalCharacter* RidePal, class UPalRiderComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UPalRideMarkerComponent* CallFunc_GetRideMarker_ReturnValue, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2);
	void CheckDirection(class AActor* RideTarget, enum class ERideActionDirection* Direction, const struct FVector& CallFunc_GetActorForwardVector_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector2D& CallFunc_Conv_VectorToVector2D_ReturnValue, const struct FVector& CallFunc_Cross_VectorVector_ReturnValue, bool CallFunc_IsNearlyZero2D_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, double CallFunc_Dot_VectorVector_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1);
	void DebugDrawLocationLocation(const struct FVector& Location, const struct FTransform& CallFunc_GetRideSocketTransform_ReturnValue, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct FVector& CallFunc_GreaterGreater_VectorRotator_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue);
	void GetLocalLocationOnFloor(const struct FVector& NativeLocation, struct FVector* Location, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, const struct FTransform& CallFunc_GetRideSocketTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue, class UPalCharacterParameterComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FVector& CallFunc_GetFloorLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, double CallFunc_FMax_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue);
	void InterpMonsterRotation(double DeltaTime, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue, const struct FVector& CallFunc_GetLastMovementInputVector_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, bool CallFunc_Vector_IsZero_ReturnValue, double CallFunc_FClamp_ReturnValue, const struct FRotator& CallFunc_REase_ReturnValue, bool CallFunc_K2_SetActorRotation_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, float CallFunc_REase_Alpha_ImplicitCast);
	void SetupRider(class APalCharacter* Rider, bool* IsSuccess, const struct FTransform& TempPoint, const struct FRotator& TempTargetRotation, const struct FVector& LastInputVector, class UPalShooterComponent* CallFunc_GetComponentByClass_ReturnValue, class UPalRiderComponent* CallFunc_GetComponentByClass_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector2D& CallFunc_Conv_VectorToVector2D_ReturnValue, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, const struct FVector2D& CallFunc_Conv_VectorToVector2D_ReturnValue_1, const struct FTransform& CallFunc_GetRelativeTransform_ReturnValue, bool CallFunc_EqualEqual_Vector2DVector2D_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Vector_Normal2D_ReturnValue, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue_1, enum class ERideActionDirection CallFunc_CheckDirection_Direction, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UPalRiderComponent* CallFunc_GetComponentByClass_ReturnValue_2, const struct FVector& CallFunc_BreakTransform_Location_1, const struct FRotator& CallFunc_BreakTransform_Rotation_1, const struct FVector& CallFunc_BreakTransform_Scale_1, bool CallFunc_IsValid_ReturnValue_1, const struct FVector& CallFunc_GetLocalLocationOnFloor_Location, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue_2, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue_3, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue_1, const struct FRotator& CallFunc_ComposeRotators_ReturnValue, class UCharacterMovementComponent* CallFunc_GetComponentByClass_ReturnValue_3, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_2, class UCharacterMovementComponent* CallFunc_GetComponentByClass_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_3, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue_5, const struct FVector& CallFunc_GetLastMovementInputVector_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue_6, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue_2, const struct FVector& CallFunc_Vector_Normal2D_ReturnValue_1, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue_1, const struct FRotator& CallFunc_ComposeRotators_ReturnValue_1, class UPalRideMarkerComponent* CallFunc_GetRideMarker_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_AttachRider_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1);
	void InterpRiderLocation(double DeltaTime, const struct FRotator& FinalRotation, const struct FVector& GoalLocation, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_1, double CallFunc_FClamp_ReturnValue, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue_1, const struct FVector& CallFunc_VEase_ReturnValue, const struct FHitResult& CallFunc_K2_SetRelativeLocation_SweepHitResult, const struct FTransform& CallFunc_MakeTransform_ReturnValue, bool CallFunc_IsAdjustRotation_ReturnValue, class APalCharacter* CallFunc_FindOwnerPalCharacter_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_3, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_1, double CallFunc_FClamp_ReturnValue_1, const struct FTransform& CallFunc_TEase_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, const struct FHitResult& CallFunc_K2_SetRelativeTransform_SweepHitResult, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_4, class USceneComponent* CallFunc_K2_GetRootComponent_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue_2, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_FClamp_ReturnValue_2, const struct FTransform& CallFunc_TEase_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetRelativeTransform_SweepHitResult_1, float CallFunc_VEase_Alpha_ImplicitCast, float CallFunc_TEase_Alpha_ImplicitCast, float CallFunc_TEase_Alpha_ImplicitCast_1);
	void OnNotifyEnd_CD532E1C42E1BEC6059709A5FB6CCC91(class FName NotifyName);
	void OnNotifyBegin_CD532E1C42E1BEC6059709A5FB6CCC91(class FName NotifyName);
	void OnInterrupted_CD532E1C42E1BEC6059709A5FB6CCC91(class FName NotifyName);
	void OnBlendOut_CD532E1C42E1BEC6059709A5FB6CCC91(class FName NotifyName);
	void OnCompleted_CD532E1C42E1BEC6059709A5FB6CCC91(class FName NotifyName);
	void OnBeginAction();
	void OnBreakAction();
	void OnEndAction();
	void TickAction(float DeltaTime);
	void ExecuteUbergraph_BP_ActionRideBase(int32 EntryPoint, class FName K2Node_CustomEvent_NotifyName_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class FName K2Node_CustomEvent_NotifyName_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class FName K2Node_CustomEvent_NotifyName_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class FName K2Node_CustomEvent_NotifyName, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class FName Temp_name_Variable, bool Temp_bool_Has_Been_Initd_Variable, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue, float K2Node_Event_DeltaTime, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_1, bool CallFunc_SetupRider_isSuccess, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_2, class FName K2Node_CustomEvent_NotifyName_4, bool CallFunc_HasAuthority_ReturnValue, const struct FHitResult& CallFunc_K2_SetActorRelativeLocation_SweepHitResult, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_3, class UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue, bool CallFunc_IsValid_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_4, class UPalRiderComponent* CallFunc_GetComponentByClass_ReturnValue, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_5, bool CallFunc_IsRiding_ReturnValue, class UPalRiderComponent* CallFunc_GetComponentByClass_ReturnValue_1, bool CallFunc_IsRiding_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_6, bool Temp_bool_IsClosed_Variable, class APalCharacter* CallFunc_GetActionCharacter_ReturnValue_7, class UPalSkeletalMeshComponent* CallFunc_GetMainMesh_ReturnValue_1, const struct FHitResult& CallFunc_K2_SetRelativeLocation_SweepHitResult, double CallFunc_InterpRiderLocation_DeltaTime_ImplicitCast, double CallFunc_InterpMonsterRotation_DeltaTime_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast);
};

}


