#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2B8 (0x530 - 0x278)
// WidgetBlueprintGeneratedClass WBP_Graphic_Settings.WBP_Graphic_Settings_C
class UWBP_Graphic_Settings_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x278(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PalTextBlock_C*                    BP_PalTextBlock_C;                                 // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_92;                                          // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_AA;                             // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_AutoContrast;                   // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_Brightness;                     // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_CameraRecoil;                   // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_CameraShake;                    // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_DLSS;                           // 0x2B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_DrawDistance;                   // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_DrawGrass;                      // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_EffectQuality;                  // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_FOV;                            // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_LODBias;                        // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_MaxFPS;                         // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_MotionBlur;                     // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_Preset;                         // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_Resolution;                     // 0x300(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_RideCameraLength;               // 0x308(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_Screen;                         // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_Shadow;                         // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_TextureQuality;                 // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_OptionSettings_ListContent_C*     WBP_OptionSettings_VSync;                          // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPalOptionGraphicsSettings            Graphics_Settings_Cache;                           // 0x330(0x54)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FPalOptionLocalStaticSettings         LocalStaticSettingCache;                           // 0x384(0x40)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                        Pad_3CAA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDataTableRowHandle>           ScreenSettingMsgIds;                               // 0x3C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<struct FDataTableRowHandle>           LevelMsgIds;                                       // 0x3D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<struct FDataTableRowHandle>           LevelMsgIds_Graphic;                               // 0x3E8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                         SomethingChanged;                                  // 0x3F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3CAD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, enum class EAntiAliasingMethod>  AAMap;                                             // 0x400(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<class FString>                        AASettings;                                        // 0x450(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, class FString>                   FPSSelection;                                      // 0x460(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                   NoLimitlMsgId;                                     // 0x4B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor)
	TArray<struct FIntPoint>                     SupportResolutions;                                // 0x4C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FDataTableRowHandle>           DLSSLevelMsgIds;                                   // 0x4D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, enum class EUDLSSMode>           DLSSMap;                                           // 0x4E0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UWBP_Graphic_Settings_C* GetDefaultObj();

	void Construct();
	void OnPresetChanged(int32 Selection);
	void OnWindowChanged(int32 Selection);
	void OnResolutionChanged(int32 Selection);
	void OnVSyncChanged(bool IsOn);
	void OnMotionBlurChanged(bool IsOn);
	void OnAAChanged(int32 Selection);
	void OnCameraShakeChanged(bool IsOn);
	void OnCameraRecoilChanged(bool IsOn);
	void OnFOVChanged(double Value);
	void OnLODChanged(double Value);
	void OnViewDisChanged(int32 Selection);
	void OnFoliageChanged(int32 Selection);
	void OnShadowChanged(int32 Selection);
	void OnBrightnessChanged(double Value);
	void OnAutoContrastChanged(bool IsOn);
	void OnTextureChanged(int32 Selection);
	void ApplySettings();
	void SetDefault();
	void OnRideCameraChanged(double Value);
	void OnDLSSChanged(int32 DLSSLevel);
	void OnMaxFPSChanged(int32 Selection);
	void OnCommonQualityChanged(int32 Selection);
	void ExecuteUbergraph_WBP_Graphic_Settings(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 K2Node_CustomEvent_Selection_9, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, uint8 CallFunc_Conv_IntToByte_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, int32 K2Node_CustomEvent_Selection_8, int32 K2Node_CustomEvent_Selection_7, int32 CallFunc_Add_IntInt_ReturnValue, bool K2Node_CustomEvent_IsOn_4, uint8 CallFunc_Conv_IntToByte_ReturnValue_1, bool K2Node_CustomEvent_IsOn_3, uint8 CallFunc_GetValidValue_ReturnValue_1, int32 K2Node_CustomEvent_Selection_6, bool K2Node_CustomEvent_IsOn_2, bool CallFunc_NotEqual_ByteByte_ReturnValue, bool K2Node_CustomEvent_IsOn_1, double K2Node_CustomEvent_Value_3, double K2Node_CustomEvent_Value_2, int32 K2Node_CustomEvent_Selection_5, int32 K2Node_CustomEvent_Selection_4, int32 K2Node_CustomEvent_Selection_3, double K2Node_CustomEvent_Value_1, bool K2Node_CustomEvent_IsOn, int32 K2Node_CustomEvent_Selection_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, int32 CallFunc_Round_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, int32 CallFunc_Conv_ByteToInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, const struct FPalOptionLocalStaticSettings& CallFunc_GetOptionLocalStaticSettings_ReturnValue, const struct FPalOptionGraphicsSettings& CallFunc_GetGraphicsSettings_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_12, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_13, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_14, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_15, enum class ESlateVisibility Temp_byte_Variable, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue_2, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue_3, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, int32 CallFunc_Conv_ByteToInt_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_16, enum class ESlateVisibility Temp_byte_Variable_1, double K2Node_CustomEvent_Value, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_17, int32 K2Node_CustomEvent_DLSSLevel, enum class EAntiAliasingMethod CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, TArray<enum class EAntiAliasingMethod>& CallFunc_Map_Values_Values, int32 CallFunc_Array_Find_ReturnValue, TArray<enum class EAntiAliasingMethod>& CallFunc_Map_Values_Values_1, int32 CallFunc_Array_Find_ReturnValue_1, bool Temp_bool_Variable, TArray<enum class EAntiAliasingMethod>& CallFunc_Map_Values_Values_2, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue_4, int32 CallFunc_Array_Find_ReturnValue_2, double CallFunc_Add_DoubleDouble_ReturnValue, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue_5, double CallFunc_Subtract_DoubleDouble_ReturnValue, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue_6, double CallFunc_Add_DoubleDouble_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_18, TArray<class FString>& CallFunc_Map_Values_Values_3, const class FString& CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, int32 K2Node_CustomEvent_Selection_1, int32 CallFunc_Array_Find_ReturnValue_3, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_SelectInt_ReturnValue, TArray<int32>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Get_Item, TArray<class FString>& K2Node_MakeArray_Array, float CallFunc_Conv_IntToFloat_ReturnValue, class FText CallFunc_GetLocalizedTextFromHandle_Text, const class FString& CallFunc_Conv_TextToString_ReturnValue, const struct FPalOptionGraphicsSettings& K2Node_MakeStruct_PalOptionGraphicsSettings, TMap<int32, class FString> K2Node_MakeMap_Map, const struct FIntPoint& CallFunc_Array_Get_Item_1, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue_7, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue_8, TArray<struct FIntPoint>& CallFunc_GetSupportScreenSizes_SupportResolutions, TArray<struct FIntPoint>& CallFunc_GetSupportScreenSizes_SupportResolutions_1, bool Temp_bool_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_19, int32 K2Node_CustomEvent_Selection, enum class EPalSupportedPlatformType CallFunc_GetPlatformType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_4, bool CallFunc_EqualEqual_ByteByte_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, enum class ESlateVisibility K2Node_Select_Default, const struct FIntPoint& CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Find_ReturnValue_4, bool CallFunc_Array_Contains_ReturnValue, int32 CallFunc_SelectInt_ReturnValue_1, const struct FIntPoint& K2Node_Select_Default_1, enum class EPalSupportedPlatformType CallFunc_GetPlatformType_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_6, bool CallFunc_EqualEqual_ByteByte_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue_1, class UPalOptionSubsystem* CallFunc_GetOptionSubsystem_ReturnValue_9, double CallFunc_Add_DoubleDouble_ReturnValue_2, bool CallFunc_IsDLSSSupported_ReturnValue, TArray<enum class EUDLSSMode>& CallFunc_Map_Values_Values_4, int32 CallFunc_Array_Find_ReturnValue_5, enum class EUDLSSMode CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_8, TArray<enum class EUDLSSMode>& CallFunc_Map_Values_Values_5, int32 CallFunc_Array_Find_ReturnValue_6, TArray<enum class EUDLSSMode>& CallFunc_Map_Values_Values_6, int32 CallFunc_Array_Find_ReturnValue_7, bool CallFunc_IsDLSSSupported_ReturnValue_1, bool CallFunc_IsDLSSSupported_ReturnValue_2, float K2Node_SetFieldsInStruct_LODBias_ImplicitCast, float K2Node_SetFieldsInStruct_Brightness_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast, double CallFunc_SetSlider_CurrentValue_ImplicitCast, double CallFunc_SetSlider_CurrentValue_ImplicitCast_1, double CallFunc_SetSlider_CurrentValue_ImplicitCast_2, double CallFunc_Round_A_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast_1, double CallFunc_SetSlider_CurrentValue_ImplicitCast_3, float K2Node_SetFieldsInStruct_PalRideCameraLengthRate_ImplicitCast, double CallFunc_SetSlider_Min_ImplicitCast, double CallFunc_SetSlider_Max_ImplicitCast, double CallFunc_SetSlider_Min_ImplicitCast_1, double CallFunc_SetSlider_Max_ImplicitCast_1, double CallFunc_Add_DoubleDouble_B_ImplicitCast, double CallFunc_Subtract_DoubleDouble_B_ImplicitCast, float K2Node_SetFieldsInStruct_FOV_ImplicitCast, double CallFunc_SetSlider_Min_ImplicitCast_2, double CallFunc_SetSlider_Max_ImplicitCast_2, double CallFunc_SetSlider_Min_ImplicitCast_3, double CallFunc_SetSlider_Max_ImplicitCast_3, double CallFunc_Add_DoubleDouble_B_ImplicitCast_1, double CallFunc_Add_DoubleDouble_A_ImplicitCast_2, double CallFunc_SetSlider_CurrentValue_ImplicitCast_4, double CallFunc_SetSlider_Min_ImplicitCast_4, double CallFunc_SetSlider_Max_ImplicitCast_4, double CallFunc_Add_DoubleDouble_B_ImplicitCast_2, double CallFunc_SetSlider_Min_ImplicitCast_5, double CallFunc_SetSlider_Max_ImplicitCast_5);
};

}


